// 11. Дано число больше 9. Вывести на экран  вторую цифру числа с конца
int a=315;
System.Console.WriteLine(a/10%10);