// 10. Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 
int n=Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Последняя цифра: " +n%10);
